"""     Задача 14: Требуется вывести все целые степени 
двойки (т.е. числа вида 2^k), не превосходящие числа N.
10 -> 1 2 4 8               """

N = int(input('Введите N: '))
degree2 = 0
i = 0
while degree2 <= N-degree2:
    degree2 = 2 ** i
    print(degree2,  end="  ")
    i += 1
